# ViewAssociatedAssemblyInstanceId Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..ViewAssociatedAssemblyInstanceId Property
ParameterTypeId Class See Also
---
"Associated Assembly Instance"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId ViewAssociatedAssemblyInstanceId { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ViewAssociatedAssemblyInstanceId As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ ViewAssociatedAssemblyInstanceId {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace